---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.Alignment.GUID
source: html/9a2d8653-3737-465c-dd14-67c5534fed45.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.GUID Property

The GUID of this alignment.

## Syntax (C#)
```csharp
public Guid GUID { get; }
```